A merged part geometry has dis-connected components.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MergedPartHasDisConnectedGeometries { get; }
  Visual Basic
Public Shared ReadOnly Property MergedPartHasDisConnectedGeometries As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MergedPartHasDisConnectedGeometries {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PartMakerMethodForMergePartFailures Class
  Autodesk.Revit.DB Namespace